{"title": "Functional requirement 1", "text": "If ATM is initialized with t dollars and parameters k,m,n are entered, then parameters are set."}
{"title": "Functional requirement 2", "text": "If no cash card is in the ATM, the system should display initial display."}
{"title": "Functional requirement 3", "text": "If the ATM is running out of money, no card should be accepted. An error message is displayed."}
{"title": "Functional requirement 4", "text": "The ATM checks if the entered card is valid. If not, it displays an error message and returns the card."}
{"title": "Functional requirement 5", "text": "If the cash card is valid, the ATM should read the serial number and bank code."}
{"title": "Functional requirement 6", "text": "The ATM should log the serial number retrieved from the cash card and then update the log file."}
{"title": "Functional requirement 7", "text": "The ATM verifies the user's password and bank code with the bank computer."}
{"title": "Functional requirement 8", "text": "Different negative answers from bank computer for authorization dialog."}
{"title": "Functional requirement 9", "text": "If password and serial number are valid, the authorization process is finished."}
{"title": "Functional requirement 10", "text": "If a card is entered more than three times at any ATM and the password is wrong each time, the ATM keeps the card and displays a message to call the bank."}
{"title": "Functional requirement 11", "text": "Successful authorization triggers money dispensing."}
{"title": "Functional requirement 12", "text": "Handle transaction restart when amount exceeds transaction policy."}
{"title": "Functional Requirement 13", "text": "ATM sets the transaction to initiated if the withdrawal sequence was successful."}
{"title": "Functional Requirement 14", "text": "If the transaction succeeds, the ATM dispenses money."}
{"title": "Functional requirement 15", "text": "If the money is dispensed, the amount is logged."}
{"title": "Functional requirement 16", "text": "If the transaction is not successful, an error message should be displayed and the card should be ejected."}
{"title": "Functional requirement 1", "text": "The bank computer checks if the bank code is valid. A bank code is valid if the cash card was issued by the bank."}
{"title": "Functional requirement 2", "text": "If it is not a valid bank code, the bank computer shall send a message to the ATM."}
{"title": "Functional requirement 3", "text": "The bank computer checks if the password is valid for a valid cash card."}
{"title": "Functional requirement 4", "text": "If the password is invalid, the bank computer sends a message to the ATM."}
{"title": "Functional requirement 5", "text": "If the cash card and the password are both valid, but there are problems with the account, the bank will send a message to the ATM."}
{"title": "Functional requirement 6", "text": "If it is a valid cash card, a valid password, and there are no problems with the account, the bank computer will send a message to the ATM indicating that everything is ok."}
{"title": "Functional requirement 7", "text": "After the request, the bank computer processes the transaction."}
{"title": "Functional requirement 8", "text": "The account is updated after the money is dispensed."}
{"title": "Functional requirement 9", "text": "Each bank has a limit k for each account regarding the amount of money available via cash card per day or month."}
{"title": "Functional requirement 10", "text": "The bank only provides security for their own computer and their own software."}
{"title": "Performance requirement 1", "text": "System shall set the error message for at least 30 seconds."}
{"title": "Performance Requirement 2", "text": "If there is no response from the bank computer after a request within 2 minutes the card is rejected with an error message."}
{"title": "Performance Requirement 3", "text": "The ATM dispenses money if and only if the withdrawal from the account is processed and accepted by the bank."}
{"title": "Performance Requirement 4", "text": "Each bank may be processing transactions from several ATMs at the same time."}
