[
  {"title": "Requirement 1", "text": "Patients must be able to book appointments with available doctors for specific time slots."},
  {"title": "Requirement 2", "text": "An appointment is linked to exactly one patient, one doctor, and one clinic location."},
  {"title": "Requirement 3", "text": "Appointments must capture the scheduled start time and planned duration in minutes."},
  {"title": "Requirement 4", "text": "Cancellations must record the cancellation timestamp and the actor (patient or staff)."},
  {"title": "Requirement 5", "text": "Each patient visit is performed at a clinic room and may reference the originating appointment."},
  {"title": "Requirement 6", "text": "Every visit is documented by exactly one clinician (doctor or nurse)."},
  {"title": "Requirement 7", "text": "During a visit, clinicians can record diagnoses and associate them with standardized codes."},
  {"title": "Requirement 8", "text": "Visits may include multiple procedures, each with a code, description, and status (planned, completed)."},
  {"title": "Requirement 9", "text": "Vital signs (blood pressure, heart rate, temperature) must be timestamped and linked to the recording clinician."},
  {"title": "Requirement 10", "text": "Laboratory orders belong to a visit, indicate the ordering clinician, and reference the patient."},
  {"title": "Requirement 11", "text": "Each lab order can produce one or more lab results with value, unit, and observation timestamp."},
  {"title": "Requirement 12", "text": "Prescriptions must specify the medication, dosage text, frequency, and the prescribing doctor."},
  {"title": "Requirement 13", "text": "Every prescription is associated with the patient and optionally the originating visit."},
  {"title": "Requirement 14", "text": "Medications have a generic name, form (tablet, liquid, etc.), and strength."},
  {"title": "Requirement 15", "text": "Insurance policies are linked to patients and store payer, policy number, and coverage tier."},
  {"title": "Requirement 16", "text": "Billing records must capture the visit, total amount due, payer, and payment status."},
  {"title": "Requirement 17", "text": "Payments should record the amount, currency, payment method, and settlement date."},
  {"title": "Requirement 18", "text": "Clinics are organized into departments; each department has a manager and one or more rooms."},
  {"title": "Requirement 19", "text": "Rooms have identifiers, capacity, and availability status for scheduling."},
  {"title": "Requirement 20", "text": "Schedules define available slots for clinicians and block overlapping bookings."},
  {"title": "Requirement 21", "text": "A clinician's license ID must be stored and validated as a non-empty string."},
  {"title": "Requirement 22", "text": "Contact information (email, phone) should be recorded for patients and clinicians."},
  {"title": "Requirement 23", "text": "Appointments must record the reason for visit in free text."},
  {"title": "Requirement 24", "text": "No appointment slot may be double-booked for the same clinician and start time."},
  {"title": "Requirement 25", "text": "Every visit outcome must indicate whether the patient was discharged, referred, or admitted."},
  {"title": "Requirement 26", "text": "Consent records link a patient to the consenting clinician, with date and scope."},
  {"title": "Requirement 27", "text": "Laboratory results must reference the corresponding lab order and include the performing lab."},
  {"title": "Requirement 28", "text": "Procedures performed during a visit should capture start/end timestamps."},
  {"title": "Requirement 29", "text": "Each insurance policy should have an effective start and optional end date."},
  {"title": "Requirement 30", "text": "Audit trails should store the actor and timestamp for scheduling actions."}
]
